lw-36/Prusa-Firmware-Buddy/src/device/stm32f4/peripherals.cpp
#include <bsod/bsod.h>
#include <device/board.h>
#include <device/peripherals.hpp>
#include <buddy/phase_stepping_opts.h>
#include <atomic>
#include "Pin.hpp"
#include "hwio_pindef.h"
#include "safe_state.h"
#include <buddy/main.h>
#include "adc.hpp"
#include "stm32f4xx_hal_adc.h"
#include "timer_defaults.h"
#include "PCA9557.hpp"
#include "TCA6408A.hpp"
#include <logging/log.hpp>
#include "timing_precise.hpp"
#include <option/has_burst_stepping.h>
#include <option/has_local_accelerometer.h>
#include <option/has_i2c_expander.h>
#include <printers.h>

// breakpoint
#include "FreeRTOS.h"
#include "task.h"

#if (BOARD_IS_XBUDDY() || BOARD_IS_XLBUDDY())
    #include "hw_configuration.hpp"
#endif

//
// I2C
//

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;
I2C_HandleTypeDef hi2c3;

//
// SPI
//

SPI_HandleTypeDef hspi2;
SPI_HandleTypeDef hspi3;
SPI_HandleTypeDef hspi4;
SPI_HandleTypeDef hspi5;
SPI_HandleTypeDef hspi6;

//
// ADCs
//

ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;
ADC_HandleTypeDef hadc3;

//
// Timers
//

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim8;
TIM_HandleTypeDef htim9;
TIM_HandleTypeDef htim13;
TIM_HandleTypeDef htim14;

//
// Other
//

RTC_HandleTypeDef hrtc;
RNG_HandleTypeDef hrng;

namespace buddy::hw {
#if HAS_I2C_EXPANDER() // HAS_I2C_EXPANDER corresponds to FDM-MK4-GPIO, not io_expander1 which connects DWARFs
TCA6408A io_expander2(*i2c_handle_io_expander2);
#endif // HAS_I2C_EXPANDER()
#if BOARD_IS_XLBUDDY()
PCA9557 io_expander1(*i2c_handle_io_expander1, 0x1);
#endif // BOARD_IS_XLBUDDY()
} // namespace buddy::hw

//
// Initialization
//

void hw_rtc_init() {
    hrtc.Instance = RTC;
    hrtc.Init.HourFormat = RTC_HOURFORMAT_24;
    hrtc.Init.AsynchPrediv = 127;
    hrtc.Init.SynchPrediv = 255;
    hrtc.Init.OutPut = RTC_OUTPUT_DISABLE;
    hrtc.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
    hrtc.Init.OutPutType = RTC_OUTPUT_TYPE_OPENDRAIN;
    if (HAL_RTC_Init(&hrtc) != HAL_OK) {
        bsod_system();
    }
    HAL_RTC_DeactivateAlarm(&hrtc, RTC_ALARM_A);
    HAL_RTC_DeactivateAlarm(&hrtc, RTC_ALARM_B);
    HAL_RTCEx_DeactivateCalibrationOutPut(&hrtc);
    HAL_RTCEx_DeactivateTamper(&hrtc, RTC_TAFCR_TAMP1E);
    HAL_RTCEx_DeactivateTimeStamp(&hrtc);
}

void hw_rng_init() {
    hrng.Instance = RNG;
    if (HAL_RNG_Init(&hrng) != HAL_OK) {
        bsod_system();
    }
}

void hw_gpio_init() {
    GPIO_InitTypeDef GPIO_InitStruct {};

    // GPIO Ports Clock Enable
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();
    __HAL_RCC_GPIOE_CLK_ENABLE();
    __HAL_RCC_GPIOF_CLK_ENABLE();
    __HAL_RCC_GPIOG_CLK_ENABLE();
    __HAL_RCC_GPIOH_CLK_ENABLE();

    // Configure GPIO pins : USB_OVERC_Pin ESP_GPIO0_Pin BED_MON_Pin WP1_Pin
#if HAS_ESP()
    GPIO_InitStruct.Pin = USB_OVERC_Pin | ESP_GPIO0_Pin | BED_MON_Pin | WP1_Pin;
#else
    GPIO_InitStruct.Pin = USB_OVERC_Pin | BED_MON_Pin | WP1_Pin;
#endif
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

#if HAS_ESP()
    // NOTE: Configuring GPIO causes a short drop of pin output to low. This is
    //       avoided by first setting the pin and then initilizing the GPIO. In case
    //       this does not work we first initilize ESP GPIO0 to avoid reset low
    //       followed by ESP GPIO low as this sequence can switch esp to boot mode
    //
    // NOTE on NOTE: We configure ESP_GPIO0_Pin as an input pin and we claim we
    //               avoid some behavior by writing to it first before
    //               configuring it again as an output pin... Sounds rather
    //               suspect, we should try to get rid of this.

    // Configure ESP GPIO0 (PROG, High for ESP module boot from Flash)
    GPIO_InitStruct.Pin = ESP_GPIO0_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_WritePin(GPIOE, ESP_GPIO0_Pin, GPIO_PIN_SET);
    HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

    // Configure GPIO pins : ESP_RST_Pin
    GPIO_InitStruct.Pin = ESP_RST_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_WritePin(GPIOC, ESP_RST_Pin, GPIO_PIN_SET);
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
#endif

    // Configure GPIO pins : WP2_Pin
    GPIO_InitStruct.Pin = WP2_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    PIN_TABLE(CONFIGURE_PINS);
#if defined(EXTENDER_PIN_TABLE)
    EXTENDER_PIN_TABLE(CONFIGURE_PINS);
#endif

    buddy::hw::hwio_configure_board_revision_changed_pins();
}

void hw_dma_init() {
    // DMA controller clock enable
    __HAL_RCC_DMA1_CLK_ENABLE();
    __HAL_RCC_DMA2_CLK_ENABLE();

#if (!PRINTER_IS_PRUSA_MINI())
    // DMA1_Stream3_IRQn interrupt configuration
    #if PRINTER_IS_PRUSA_XL()
    HAL_NVIC_SetPriority(DMA1_Stream3_IRQn, ISR_PRIORITY_PUPPIES_USART, 0);
    #else
    HAL_NVIC_SetPriority(DMA1_Stream3_IRQn, ISR_PRIORITY_DEFAULT, 0);
    #endif
    HAL_NVIC_EnableIRQ(DMA1_Stream3_IRQn);
#endif

#if (BOARD_IS_XBUDDY())
    // Accelerometer DMA
    HAL_NVIC_SetPriority(DMA1_Stream3_IRQn, ISR_PRIORITY_ACCELEROMETER, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream3_IRQn);

    HAL_NVIC_SetPriority(DMA1_Stream4_IRQn, ISR_PRIORITY_ACCELEROMETER, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream4_IRQn);
#endif

#if (BOARD_IS_XBUDDY() || BOARD_IS_XLBUDDY())
    // DMA1_Stream0_IRQn interrupt configuration
    HAL_NVIC_SetPriority(DMA1_Stream0_IRQn, ISR_PRIORITY_DEFAULT, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream0_IRQn);
    // DMA1_Stream2_IRQn interrupt configuration
    HAL_NVIC_SetPriority(DMA1_Stream2_IRQn, ISR_PRIORITY_DEFAULT, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream2_IRQn);
    // DMA1_Stream6_IRQn interrupt configuration
    HAL_NVIC_SetPriority(DMA1_Stream6_IRQn, ISR_PRIORITY_DEFAULT, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream6_IRQn);
    // DMA2_Stream3_IRQn interrupt configuration
    HAL_NVIC_SetPriority(DMA2_Stream3_IRQn, ISR_PRIORITY_DEFAULT, 0);
    HAL_NVIC_EnableIRQ(DMA2_Stream3_IRQn);
    // DMA2_Stream4_IRQn interrupt configuration
    HAL_NVIC_SetPriority(DMA2_Stream4_IRQn, ISR_PRIORITY_DEFAULT, 0);
    HAL_NVIC_EnableIRQ(DMA2_Stream4_IRQn);
    // DMA2_Stream5_IRQn interrupt configuration
    HAL_NVIC_SetPriority(DMA2_Stream5_IRQn, ISR_PRIORITY_DEFAULT, 0);
    HAL_NVIC_EnableIRQ(DMA2_Stream5_IRQn);
    // DMA2_Stream7_IRQn interrupt configuration
    #if PRINTER_IS_PRUSA_iX() || PRINTER_IS_PRUSA_COREONE() || PRINTER_IS_PRUSA_COREONEL()
    HAL_NVIC_SetPriority(DMA2_Stream7_IRQn, ISR_PRIORITY_PUPPIES_USART, 0);
    #else
    HAL_NVIC_SetPriority(DMA2_Stream7_IRQn, ISR_PRIORITY_DEFAULT, 0);
    #endif
    HAL_NVIC_EnableIRQ(DMA2_Stream7_IRQn);
#endif
    // DMA1_Stream0_IRQn interrupt configuration
    HAL_NVIC_SetPriority(DMA1_Stream0_IRQn, ISR_PRIORITY_DEFAULT, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream0_IRQn);

#if BOARD_IS_XLBUDDY()
    // DMA1_Stream1_IRQn interrupt configuration
    HAL_NVIC_SetPriority(DMA1_Stream1_IRQn, ISR_PRIORITY_PUPPIES_USART, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream1_IRQn);

