lw-36/Prusa-Firmware-Buddy/src/device/stm32f4/peripherals.cpp
    // DMA2_Stream0_IRQn interrupt configuration */
    HAL_NVIC_SetPriority(DMA2_Stream0_IRQn, ISR_PRIORITY_DEFAULT, 0);
    HAL_NVIC_EnableIRQ(DMA2_Stream0_IRQn);
#endif

    // DMA1_Stream4_IRQn interrupt configuration
    HAL_NVIC_SetPriority(DMA1_Stream4_IRQn, ISR_PRIORITY_DEFAULT, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream4_IRQn);
    // DMA1_Stream5_IRQn interrupt configuration
    HAL_NVIC_SetPriority(DMA1_Stream5_IRQn, ISR_PRIORITY_DEFAULT, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream5_IRQn);
    // DMA1_Stream7_IRQn interrupt configuration
    HAL_NVIC_SetPriority(DMA1_Stream7_IRQn, ISR_PRIORITY_DEFAULT, 0);
    HAL_NVIC_EnableIRQ(DMA1_Stream7_IRQn);
    // DMA2_Stream1_IRQn interrupt configuration
    HAL_NVIC_SetPriority(DMA2_Stream1_IRQn, ISR_PRIORITY_DEFAULT, 0);
    HAL_NVIC_EnableIRQ(DMA2_Stream1_IRQn);
// DMA2_Stream2_IRQn interrupt configuration
#if (PRINTER_IS_PRUSA_iX() || PRINTER_IS_PRUSA_COREONE() || PRINTER_IS_PRUSA_COREONEL())
    HAL_NVIC_SetPriority(DMA2_Stream2_IRQn, ISR_PRIORITY_PUPPIES_USART, 0);
#else
    HAL_NVIC_SetPriority(DMA2_Stream2_IRQn, ISR_PRIORITY_DEFAULT, 0);
#endif
    HAL_NVIC_EnableIRQ(DMA2_Stream2_IRQn);
    // DMA2_Stream2_IRQn interrupt configuration
    HAL_NVIC_SetPriority(DMA2_Stream4_IRQn, ISR_PRIORITY_DEFAULT, 0);
    HAL_NVIC_EnableIRQ(DMA2_Stream4_IRQn);
    // DMA2_Stream6_IRQn interrupt configuration
    HAL_NVIC_SetPriority(DMA2_Stream6_IRQn, ISR_PRIORITY_DEFAULT, 0);
    HAL_NVIC_EnableIRQ(DMA2_Stream6_IRQn);
}

void static config_adc(ADC_HandleTypeDef *hadc, ADC_TypeDef *ADC_NUM, uint32_t NbrOfConversion) {
    hadc->Instance = ADC_NUM;
    hadc->Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4;
    hadc->Init.Resolution = ADC_RESOLUTION_12B;
    hadc->Init.ScanConvMode = ENABLE;
    hadc->Init.ContinuousConvMode = ENABLE;
    hadc->Init.DiscontinuousConvMode = DISABLE;
    hadc->Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
    hadc->Init.ExternalTrigConv = ADC_SOFTWARE_START;
    hadc->Init.DataAlign = ADC_DATAALIGN_RIGHT;
    hadc->Init.NbrOfConversion = NbrOfConversion;
    hadc->Init.DMAContinuousRequests = ENABLE;
    hadc->Init.EOCSelection = ADC_EOC_SINGLE_CONV;
    if (HAL_ADC_Init(hadc) != HAL_OK) {
        bsod_system();
    }
}

static void config_adc_ch(ADC_HandleTypeDef *hadc, uint32_t Channel, uint32_t Rank) {
    // To make the MCU temperature measurement accurate we need to have higher sample time.
    // The data sheet says for 1C accuracy measure for at least 10us.
    // With 480 cycles we get around +- 0.3C accuracy.
    // With 144 cycles we get around +- 0.5C accuracy + the total value is about 0.35 higher then with 480 cycles.
    // 144 cycles is still good enough (also still keeps AWDG fast).
    // If the MCU overheat will keep happening we can increase the cycles to 480
    auto sample_time = ADC_SAMPLETIME_28CYCLES;
    if (hadc == &hadc1 && (Channel == ADC_CHANNEL_TEMPSENSOR || Channel == ADC_CHANNEL_VREFINT)) {
        sample_time = ADC_SAMPLETIME_480CYCLES;
    }
    Rank++; // Channel rank starts at 1, but for array indexing, we need to start from 0.
    ADC_ChannelConfTypeDef sConfig = { Channel, Rank, sample_time, 0 };
    if (HAL_ADC_ConfigChannel(hadc, &sConfig) != HAL_OK) {
        bsod_system();
    }
}

void hw_adc1_init() {
    // Configure the global features of the ADC (Clock, Resolution, Data Alignment and number of conversion)
    config_adc(&hadc1, ADC1, AdcChannel::ADC1_CH_CNT);

    // Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time.
#if (BOARD_IS_BUDDY())
    config_adc_ch(&hadc1, ADC_CHANNEL_10, AdcChannel::hotend_T);
    config_adc_ch(&hadc1, ADC_CHANNEL_4, AdcChannel::heatbed_T);
    config_adc_ch(&hadc1, ADC_CHANNEL_5, AdcChannel::board_T);
    config_adc_ch(&hadc1, ADC_CHANNEL_6, AdcChannel::pinda_T);
    config_adc_ch(&hadc1, ADC_CHANNEL_3, AdcChannel::heatbed_U);
    config_adc_ch(&hadc1, ADC_CHANNEL_TEMPSENSOR, AdcChannel::mcu_temperature);
    config_adc_ch(&hadc1, ADC_CHANNEL_VREFINT, AdcChannel::vref);
#elif (BOARD_IS_XBUDDY() && PRINTER_IS_PRUSA_MK3_5())
    config_adc_ch(&hadc1, ADC_CHANNEL_10, AdcChannel::hotend_T);
    config_adc_ch(&hadc1, ADC_CHANNEL_4, AdcChannel::heatbed_T);
    config_adc_ch(&hadc1, ADC_CHANNEL_5, AdcChannel::heatbed_U);
    config_adc_ch(&hadc1, ADC_CHANNEL_3, AdcChannel::hotend_U);
    config_adc_ch(&hadc1, ADC_CHANNEL_VREFINT, AdcChannel::vref);
    config_adc_ch(&hadc1, ADC_CHANNEL_TEMPSENSOR, AdcChannel::mcu_temperature);
#elif (BOARD_IS_XBUDDY())
    config_adc_ch(&hadc1, ADC_CHANNEL_10, AdcChannel::hotend_T);
    config_adc_ch(&hadc1, ADC_CHANNEL_4, AdcChannel::heatbed_T);
    config_adc_ch(&hadc1, ADC_CHANNEL_5, AdcChannel::heatbed_U);
    config_adc_ch(&hadc1, ADC_CHANNEL_6, AdcChannel::heatbreak_T);
    config_adc_ch(&hadc1, ADC_CHANNEL_3, AdcChannel::hotend_U);
    config_adc_ch(&hadc1, ADC_CHANNEL_VREFINT, AdcChannel::vref);
    config_adc_ch(&hadc1, ADC_CHANNEL_TEMPSENSOR, AdcChannel::mcu_temperature);
#elif BOARD_IS_XLBUDDY()
    config_adc_ch(&hadc1, ADC_CHANNEL_4, AdcChannel::dwarf_I);
    config_adc_ch(&hadc1, ADC_CHANNEL_5, AdcChannel::mux1_y);
    config_adc_ch(&hadc1, ADC_CHANNEL_8, AdcChannel::mux1_x);
    config_adc_ch(&hadc1, ADC_CHANNEL_VREFINT, AdcChannel::vref);
    config_adc_ch(&hadc1, ADC_CHANNEL_TEMPSENSOR, AdcChannel::mcu_temperature);
#else
    #error Unknown board
#endif

    // Disable ADC DMA IRQ by default. This is enabled on-demand by AdcMultiplexer
    HAL_NVIC_DisableIRQ(DMA2_Stream4_IRQn);
}

#ifdef HAS_ADC3
void hw_adc3_init() {
    // Configure the global features of the ADC (Clock, Resolution, Data Alignment and number of conversion)
    config_adc(&hadc3, ADC3, AdcChannel::ADC3_CH_CNT);

    // Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time.
    #if BOARD_IS_XBUDDY()
    config_adc_ch(&hadc3, ADC_CHANNEL_4, AdcChannel::MMU_I);
    config_adc_ch(&hadc3, ADC_CHANNEL_8, AdcChannel::board_T);
    config_adc_ch(&hadc3, ADC_CHANNEL_9, AdcChannel::hotend_I);
    config_adc_ch(&hadc3, ADC_CHANNEL_14, AdcChannel::board_I);
        #if PRINTER_IS_PRUSA_iX()
    config_adc_ch(&hadc3, ADC_CHANNEL_15, AdcChannel::case_T);
        #elif PRINTER_IS_PRUSA_COREONE() || PRINTER_IS_PRUSA_COREONEL() || PRINTER_IS_PRUSA_MK4()
    config_adc_ch(&hadc3, ADC_CHANNEL_15, AdcChannel::door_sensor);
        #endif
    #elif BOARD_IS_XLBUDDY()
    config_adc_ch(&hadc3, ADC_CHANNEL_8, AdcChannel::board_T);
    config_adc_ch(&hadc3, ADC_CHANNEL_4, AdcChannel::mux2_y);
    config_adc_ch(&hadc3, ADC_CHANNEL_10, AdcChannel::mux2_x);

    #else
        #error Unknown board
    #endif

    // Disable ADC DMA IRQ by default. This is enabled on-demand by AdcMultiplexer
    HAL_NVIC_DisableIRQ(DMA2_Stream0_IRQn);
}
#endif

void hw_adc_irq_init() {
    HAL_NVIC_SetPriority(ADC_IRQn, ISR_PRIORITY_DEFAULT, 0);
    HAL_NVIC_EnableIRQ(ADC_IRQn);
}

