lw-36/Prusa-Firmware-Buddy/src/device/stm32f4/peripherals.cpp
struct hw_pin {
    GPIO_TypeDef *port;
    uint16_t no;
};

/**
 * @brief Set the pin to open-drain
 */
static void set_pin_od(hw_pin pin) {
    GPIO_InitTypeDef GPIO_InitStruct {};
    GPIO_InitStruct.Pin = pin.no;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
    GPIO_InitStruct.Alternate = 0;
    HAL_GPIO_Init(pin.port, &GPIO_InitStruct);
}

/**
 * @brief Set the pin to input
 */
static void set_pin_in(hw_pin pin) {
    GPIO_InitTypeDef GPIO_InitStruct {};
    GPIO_InitStruct.Pin = pin.no;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
    GPIO_InitStruct.Alternate = 0;
    HAL_GPIO_Init(pin.port, &GPIO_InitStruct);
}

/**
 * @brief calculate edge timing
 * edges timing is of half period
 * round up
 *
 * @param clk frequency [Hz]
 * @return constexpr uint32_t half of period [us]
 */
static constexpr uint32_t i2c_get_edge_us(uint32_t clk) {
    // clk + 1 .. round up
    // / 2     .. need half of period
    return (1'000'000 % clk ? (1'000'000 / clk + 1) : (1'000'000 / clk)) / 2;
}

/**
 * @brief unblock i2c data pin
 * apply up to 32 clock pulses and check SDA logical level
 * make sure it is in '1', so master can manipulate with it
 *
 * @param clk   frequency [Hz]
 * @param sda   pin of data
 * @param scl   pin of clock
 */
static void i2c_unblock_sda(uint32_t clk, hw_pin sda, hw_pin scl) {
    delay_us_precise(i2c_get_edge_us(clk)); // half period - ensure first edge is not too short

    // ORIGINAL COMMENT (i < 9): 9 pulses, there is no point to try it more times - 9th bit is ACK (will be NACK)
    // Changed to an arbitrary higher value, because comm with the touchscreen controller is extra sketchy, clock gets lost sometimes and such
    // Cannot be used on multi-master buses
    for (size_t i = 0; i < 32; ++i) {
        HAL_GPIO_WritePin(scl.port, scl.no, GPIO_PIN_SET); // set clock to '1'
        delay_us_precise(i2c_get_edge_us(clk)); // wait half period
        if (HAL_GPIO_ReadPin(sda.port, sda.no) == GPIO_PIN_SET) { // check if slave does not pull SDA to '0' while SCL == 1
            return; // sda is not pulled by a slave, it is done
        }

        HAL_GPIO_WritePin(scl.port, scl.no, GPIO_PIN_RESET); // set clock to '0'
        delay_us_precise(i2c_get_edge_us(clk)); // wait half period
    }

// in case code reaches this, there is some HW issue
// but we cannot log it or rise red screen, it is too early
#if defined(_DEBUG) || DEVELOPER_MODE()
    buddy_disable_heaters();
    __BKPT(0);
#endif
    HAL_GPIO_WritePin(scl.port, scl.no, GPIO_PIN_SET); // this code should never be reached, just in case it was set clock to '1'
}

/**
 * @brief free I2C in case of slave deadlock
 * in case printer is resetted during I2C transmit, slave can deadlock
 * it has not been resetted and is expecting clock to finish its command
 * problem is that it can hold SDA in '0' - it blocks the bus so master cannot do start / stop condition
 * this code generates a clock until SDA is in '1' and than master sdoes start + stop to end any slave communication
 *
 * @param clk   frequency [Hz]
 * @param sda   pin of data
 * @param scl   pin of clock
 */
static void i2c_free_bus_in_case_of_slave_deadlock(uint32_t clk, hw_pin sda, hw_pin scl) {
    set_pin_in(sda); // configure SDA to input
    if (HAL_GPIO_ReadPin(sda.port, sda.no) == GPIO_PIN_RESET) { // check if slave pulls SDA to '0' while SCL == 1
        set_pin_od(scl); // configure SCL to open-drain
        i2c_unblock_sda(clk, sda, scl); // get SDA pin in state pin can be "moved"
    }

    set_pin_od(sda); // reconfigure SDA to open-drain, to be able to move it
    HAL_GPIO_WritePin(sda.port, sda.no, GPIO_PIN_RESET); // set SDA to '0' while SCL == '1' - start condition
    delay_us_precise(i2c_get_edge_us(clk)); // wait half period
    HAL_GPIO_WritePin(sda.port, sda.no, GPIO_PIN_SET); // set SDA to '1' while SCL == '1' - stop condition
    delay_us_precise(i2c_get_edge_us(clk)); // wait half period
}

#if HAS_I2C1()

static constexpr uint32_t i2c1_speed = 400'000;

void hw_i2c1_pins_init() {
    GPIO_InitTypeDef GPIO_InitStruct {};

    __HAL_RCC_GPIOB_CLK_ENABLE();

    i2c_free_bus_in_case_of_slave_deadlock(i2c1_speed, { i2c1_SDA_PORT, i2c1_SDA_PIN }, { i2c1_SCL_PORT, i2c1_SCL_PIN });

    // GPIO I2C mode
    GPIO_InitStruct.Pin = i2c1_SDA_PIN | i2c1_SCL_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF4_I2C1;
    HAL_GPIO_Init(i2c1_SDA_PORT, &GPIO_InitStruct);

    // Peripheral clock enable
    __HAL_RCC_I2C1_CLK_ENABLE();
}

void hw_i2c1_init() {
    hi2c1.Instance = I2C1;
    hi2c1.Init.ClockSpeed = i2c1_speed;

    hi2c1.Init.DutyCycle = I2C_DUTYCYCLE_2;
    hi2c1.Init.OwnAddress1 = 0;
    hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
    hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    hi2c1.Init.OwnAddress2 = 0;
    hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
    if (HAL_I2C_Init(&hi2c1) != HAL_OK) {
        bsod_system();
    }

    #if defined(I2C_FLTR_ANOFF) && defined(I2C_FLTR_DNF)
    // Configure Analog filter
    if (HAL_I2CEx_ConfigAnalogFilter(&hi2c1, I2C_ANALOGFILTER_ENABLE) != HAL_OK) {
        bsod_system();
    }
    // Configure Digital filter
    if (HAL_I2CEx_ConfigDigitalFilter(&hi2c1, 0) != HAL_OK) {
        bsod_system();
    }
    #endif
}
#endif // HAS_I2C1()

#if HAS_I2C2()

// speed must be 400k, maybe, for reasons lost in time
static constexpr uint32_t i2c2_speed = 400'000;

void hw_i2c2_pins_init() {
    GPIO_InitTypeDef GPIO_InitStruct {};

    __HAL_RCC_GPIOF_CLK_ENABLE();

    i2c_free_bus_in_case_of_slave_deadlock(i2c2_speed, { i2c2_SDA_PORT, i2c2_SDA_PIN }, { i2c2_SCL_PORT, i2c2_SCL_PIN });

    // GPIO I2C mode
    GPIO_InitStruct.Pin = i2c2_SDA_PIN | i2c2_SCL_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF4_I2C2;
    HAL_GPIO_Init(i2c2_SDA_PORT, &GPIO_InitStruct);

    // Peripheral clock enable
    __HAL_RCC_I2C2_CLK_ENABLE();
}

void hw_i2c2_init() {
    hi2c2.Instance = I2C2;
    hi2c2.Init.ClockSpeed = i2c2_speed;

    hi2c2.Init.DutyCycle = I2C_DUTYCYCLE_2;
    hi2c2.Init.OwnAddress1 = 0;
    hi2c2.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
    hi2c2.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    hi2c2.Init.OwnAddress2 = 0;
    hi2c2.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    hi2c2.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
    if (HAL_I2C_Init(&hi2c2) != HAL_OK) {
        bsod_system();
    }

    #if defined(I2C_FLTR_ANOFF) && defined(I2C_FLTR_DNF)
    // Configure Analog filter
    if (HAL_I2CEx_ConfigAnalogFilter(&hi2c2, I2C_ANALOGFILTER_ENABLE) != HAL_OK) {
        bsod_system();
    }
    // Configure Digital filter to maximum (tHD:STA 0.357us delay)
    if (HAL_I2CEx_ConfigDigitalFilter(&hi2c2, 0x0F) != HAL_OK) {
        bsod_system();
    }
    #endif
}
#endif // HAS_I2C2()

