lw-36/Prusa-Firmware-Buddy/src/device/stm32f4/peripherals.cpp
    htim2.Instance = TIM2;
    htim2.Init.Prescaler = 100;
    htim2.Init.CounterMode = TIM_COUNTERMODE_DOWN;
    htim2.Init.Period = 42000;
    htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    if (HAL_TIM_Base_Init(&htim2) != HAL_OK) {
        bsod_system();
    }
    sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
    if (HAL_TIM_ConfigClockSource(&htim2, &sClockSourceConfig) != HAL_OK) {
        bsod_system();
    }
    if (HAL_TIM_PWM_Init(&htim2) != HAL_OK) {
        bsod_system();
    }
    sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
    sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
    if (HAL_TIMEx_MasterConfigSynchronization(&htim2, &sMasterConfig) != HAL_OK) {
        bsod_system();
    }
    sConfigOC.OCMode = TIM_OCMODE_PWM1;
    sConfigOC.Pulse = 21000;
    sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
    sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
    if (HAL_TIM_PWM_ConfigChannel(&htim2, &sConfigOC, TIM_CHANNEL_1) != HAL_OK) {
        bsod_system();
    }

    HAL_TIM_MspPostInit(&htim2);
}

void hw_tim3_init() {
    TIM_ClockConfigTypeDef sClockSourceConfig {};
    TIM_MasterConfigTypeDef sMasterConfig {};
    TIM_OC_InitTypeDef sConfigOC {};

    htim3.Instance = TIM3;
#if BOARD_IS_BUDDY()
    htim3.Init.Prescaler = TIM3_default_Prescaler; // 49ms, 20.3Hz
#elif BOARD_IS_XBUDDY()
    htim3.Init.Prescaler = 11; // 36us, 33.0kHz
#elif BOARD_IS_XLBUDDY()
    bsod_unreachable();
#else
    // #error dead code found by automatic analyses (see BFW-5461)
    // If there ever is another board, this needs to fail loudly.
    #error "Unsupported board"
#endif
    htim3.Init.CounterMode = TIM_COUNTERMODE_DOWN;
    htim3.Init.Period = TIM3_default_Period; // 0xff was 42000
    htim3.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    if (HAL_TIM_Base_Init(&htim3) != HAL_OK) {
        bsod_system();
    }
    sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
    if (HAL_TIM_ConfigClockSource(&htim3, &sClockSourceConfig) != HAL_OK) {
        bsod_system();
    }
    if (HAL_TIM_PWM_Init(&htim3) != HAL_OK) {
        bsod_system();
    }
    sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
    sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
    if (HAL_TIMEx_MasterConfigSynchronization(&htim3, &sMasterConfig) != HAL_OK) {
        bsod_system();
    }
    sConfigOC.OCMode = TIM_OCMODE_PWM1;
    sConfigOC.Pulse = 21000;
    sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
    sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
    if (HAL_TIM_PWM_ConfigChannel(&htim3, &sConfigOC, TIM_CHANNEL_3) != HAL_OK) { //_PWM_HEATER_BED
        bsod_system();
    }
    if (HAL_TIM_PWM_ConfigChannel(&htim3, &sConfigOC, TIM_CHANNEL_4) != HAL_OK) { //_PWM_HEATER_0
        bsod_system();
    }

    HAL_TIM_MspPostInit(&htim3);
    __HAL_TIM_ENABLE(&htim3);
}

void hw_tim4_init() {
    // Configure TIM as a one-pulse delay generator for os_delay_us().
    // Prescaler yields 1 MHz tick (1 us per count).
    // 16-bit ARR => max 65535 us
    __HAL_RCC_TIM4_CLK_ENABLE();
    htim4.Instance = TIM4;
    htim4.Init.Prescaler = TIM_BASE_CLK_MHZ - 1; // 84-1 -> 1 MHz -> 1 us/tick
    htim4.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim4.Init.Period = 0xFFFF; // reset value, updated on each use
    htim4.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    htim4.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    if (HAL_TIM_OnePulse_Init(&htim4, TIM_OPMODE_SINGLE) != HAL_OK) {
        bsod_system();
    }
    __HAL_TIM_CLEAR_FLAG(&htim4, TIM_FLAG_UPDATE);
    __HAL_TIM_ENABLE_IT(&htim4, TIM_IT_UPDATE);
    HAL_NVIC_SetPriority(TIM4_IRQn, ISR_PRIORITY_DEFAULT, 0);
    HAL_NVIC_EnableIRQ(TIM4_IRQn);
}

#if HAS_BURST_STEPPING()
// #error dead code found by automatic analyses (see BFW-5461)
void hw_tim8_init() {
    TIM_ClockConfigTypeDef sClockSourceConfig {};
    TIM_MasterConfigTypeDef sMasterConfig {};

    using phase_stepping::opts::GPIO_BUFFER_SIZE;
    using phase_stepping::opts::REFRESH_FREQ;

    // Clock the period ever-so-slighly faster than the required number of events to create a gap
    // between two bursts big enough to allow scheduling in the case of two full buffers and a
    // shorter-than-expected interval between the ISRs.
    uint32_t period = 168'000'000 / (REFRESH_FREQ * (GPIO_BUFFER_SIZE + 1)) - 1;

    htim8.Instance = TIM8;
    htim8.Init.Prescaler = 0;
    htim8.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim8.Init.Period = period;
    htim8.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    if (HAL_TIM_Base_Init(&htim8) != HAL_OK) {
        bsod_system();
    }

    sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
    if (HAL_TIM_ConfigClockSource(&htim8, &sClockSourceConfig) != HAL_OK) {
        bsod_system();
    }

    sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
    sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
    if (HAL_TIMEx_MasterConfigSynchronization(&htim8, &sMasterConfig) != HAL_OK) {
        bsod_system();
    }

    HAL_TIM_MspPostInit(&htim8);
}
#endif // HAS_BURST_STEPPING()

#if HAS_LOCAL_ACCELEROMETER()
void hw_tim9_init() {
    TIM_ClockConfigTypeDef sClockSourceConfig {};
    TIM_MasterConfigTypeDef sMasterConfig {};

    // This timer is used for local accelerometer polling. The polling rate has
    // to be higher than the actual accelerometer sampling rate. The sampling
    // rate of LIS2DH12 is ~1.5 kH. Hence, we use double the rate.
    htim9.Instance = TIM9;
    htim9.Init.Prescaler = 1680 - 1; // 100kHz
    htim9.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim9.Init.Period = 33 - 1; // ~3 kHz
    htim9.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    if (HAL_TIM_Base_Init(&htim9) != HAL_OK) {
        bsod_system();
    }

    sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
    if (HAL_TIM_ConfigClockSource(&htim9, &sClockSourceConfig) != HAL_OK) {
        bsod_system();
    }

    sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
    sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
    if (HAL_TIMEx_MasterConfigSynchronization(&htim9, &sMasterConfig) != HAL_OK) {
        bsod_system();
    }

    HAL_TIM_MspPostInit(&htim9);
}
#endif // HAS_LOCAL_ACCELEROMETER()

void hw_tim13_init() {
    htim13.Instance = TIM13;
    htim13.Init.Prescaler = 0;
    htim13.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim13.Init.Period = 84'000'000 / phase_stepping::opts::REFRESH_FREQ - 1;
    htim13.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    htim13.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    if (HAL_TIM_Base_Init(&htim13) != HAL_OK) {
        bsod_system();
    }
}

void hw_tim14_init() {
    htim14.Instance = TIM14;
    htim14.Init.Prescaler = 84;
    htim14.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim14.Init.Period = 1000;
    htim14.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    if (HAL_TIM_Base_Init(&htim14) != HAL_OK) {
        bsod_system();
    }
    HAL_TIM_Base_Start_IT(&htim14);
}
